선생님 — 2023.02.09. 오후 8:42
# 숫자 와 문자열 

# 123 정수(숫자) : int (integer)
# "123" 문자열(글자+글자) : str (string)
# 사 칙 연 산
# + 더하기 
# - 빼기 
# * 곱하기 
# / 나누기
# // 몫 구하기
# % 나머지 구하기

# 컴퓨터는 어떻게 읽지?
# 뒤에서 부터 읽어요
# ans = 34 // 10
# 34 나누기 10 의 몫을 구한 후
# ans 에 담으세요(초기화)
# ans? 3이 됩니다.
선생님 — 2023.02.09. 오후 9:07
# "1234"와 "4321"를 더할수 있나요? 
# 1234 와 4321을 더한값을 ans2 라고 해보세요 그리고 
# 있다면 그값을 ans1 이라고 정의하구 ans1,ans2 을 출력해보세요
# 출력될 ans1,ans2값을 주석으로 적으세요
# ans1 = "1"+"2"+"3"+"4" 
# ans1 = "1234"

# ans1 = "1234" + "4321" = "12344321"

# ans3 = "4321" + 4321 (X)
# ans1 = "1"+"2"+"3"+"4" 
# ans1 = "1234"

# ans1 = "1234" + "4321" = "12344321"

# ans3 = "4321" + 4321 (X)
