선생님 — 2023.02.16. 오후 8:08
# "1234"와 "4321"를 더할수 있나요? 
# 1234 와 4321을 더한값을 ans2 라고 해보세요 그리고 
# 있다면 그값을 ans1 이라고 정의하구 ans1,ans2 을 출력해보세요
# 출력될 ans1,ans2값을 주석으로 적으세요 

# ans1 = "1"+"2"+"3"+"4" 
# ans1 = "1234"
# ans1 = "1234" + "4321" = "12344321"


ans3 = "4321" +4321

print(ans3)


# 1번 
# 9237 + "3141"
# ??
# 1. 92373141
# 2.12378
# 3. 오류 

# 2번
# 32 와 81 을 나란히 출력하세요
선생님 — 2023.02.16. 오후 8:33
# 변하는 수가 뭐지?
# 변수랑 초기화은 친구 

kg = 55

#kg = kg + 3
#kg += 3

#kg = kg - 3
#kg -= 3

#kg += -3
#kg = kg +(-3)

# kg = kg4
# kg= 4

# kg = kg/5
# kg /= 5

# kg = kg % 3
# kg %= 3

print(kg)
# 변하는 수가 뭐지?
# 변수랑 초기화은 친구 

kg = 55

#kg = kg + 3
#kg += 3

#kg = kg - 3
#kg -= 3

#kg += -3
#kg = kg +(-3)

# kg = kg4
# kg= 4

# kg = kg/5
# kg /= 5

# kg = kg % 3
# kg %= 3

print(kg)
요기
