입력받아 계산 4
정수 입력받아 계산
실수 받아 그대로 출력
길이 단위 환산하기
실수 입력받아 계산 2
변수 -> 함수명 (변수) -> x
#
dcar -> 세차장 -> ccar = "깨끗"
012345678
----------------------
매개변수 : parameter
인자 : argument
함수는 인자(넣는값) 있어도 되고 없어도 돼요
함수는 리턴(반환) 이 있어도 되고 없어도 돼요
뭐가 꼭있어야돼요?
def 함수이름 ( [매개변수,인자] ) :
def      함수 시작해요
함수이름   읽어요
()       함수 인자 있어요 or 없어요
:        함수 헤드가 끝났어요
함수는 들여쓰기를 해야해 Tab을 이용해서
print()
input()
a = input() # str
print(type(a))
str(input())
int(input())
a = 123   # 정수 
b = "백이십삼" # 문자열
c = '123' # 문자열
d = "1"+"2"+"3" # 문자열
e = 1+2+3 # 정수
f = 1.23  # 실수
g = 123.0 # 실수 
h = "123.0" # 문자열
i = 0 # 정수
j = 0.0 # 실수 
str to int
int to float
int to str
정수 = {양의 정수 , 음의 정수 ,0}
자료형 / 변수 형태 뭐니?
str   int  float
문자열  정수형  실수형
int()
float()
기본 적을 처리하는게 뭐야 ? str : input()
input() => str
그래서 값을 바꿔 주고 싶을 때는요?
형변환을 해야해요 -어떻게?  바꾸고싶은 /  자료형(값) => 자료의 형이 바뀌어요
정수 a 를 입력받고 ,
입력받고: input()
정수: int()
a = 18
a += 2 # a = a + 2 

변수의 친구 초기화!
a = 18
print(a + 2)  # a = 18
a = 18
입력받고
a = int(input())

print(a)
